<?php

return [
    'labels' => [
        'billing' => 'صورتحساب',
        'gateways' => 'درگاه‌ها',
        'to_card' => 'کارت به کارت',
        'status' => 'وضعیت کارت به کارت',
        'card_number' => 'شماره کارت',
        'card_name' => 'نام صاحب کارت',
        'transactions_chat_id' => 'شناسه چت تراکنش‌ها',
        'sms_bank' => 'بانک تایید خودکار پیامکی',
        'sms_secret' => 'کلید محرمانه وب‌هوک پیامک',
        'unique_amount' => 'مبالغ منحصربه‌فرد پرداخت',
    ],

    'descriptions' => [
        'billing' => 'تنظیمات پرداخت و صورتحساب ربات.',
        'gateways' => 'درگاه‌های پرداخت قابل استفاده توسط مشتریان را فعال و پیکربندی کنید.',
        'to_card' => 'پذیرش پرداخت‌های دستی کارت به کارت.',
        'status' => 'پرداخت کارت به کارت را فعال یا غیرفعال کنید.',
        'card_number' => 'شماره کارتی که مشتریان باید مبلغ را به آن واریز کنند.',
        'card_name' => 'نام صاحب کارت که به مشتریان نمایش داده می‌شود.',
        'transactions_chat_id' => 'شناسه چتی که رسید پرداخت‌های کارتی برای بررسی به آن ارسال می‌شود.',
        'sms_bank' => 'فرمت پیامک واریزی کدام بانک برای تایید خودکار پرداخت شناسایی شود.',
        'sms_secret' => "کلید مشترکی که برای تایید پیامک‌های ارسالی از گوشی شما استفاده می‌شود. باید با کلید تنظیم‌شده در اپلیکیشن فورواردر یکسان باشد.\n\nآدرس اپلیکیشن فورواردر: :url",
        'unique_amount' => 'مبلغ کوچک تصادفی به هر فاکتور کارت‌به‌کارت اضافه می‌شود تا پرداخت‌ها به‌طور خودکار از هم تشخیص داده شوند.',
    ],
];
